---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarBendingDetailType.BendDiameterDimensionsEnabled
source: html/6571d5bd-8134-3f8d-a9a9-0b43c90fa840.htm
---
# Autodesk.Revit.DB.Structure.RebarBendingDetailType.BendDiameterDimensionsEnabled Property

Identifies if any radial or diameter dimensions will be shown or not.

## Syntax (C#)
```csharp
public bool BendDiameterDimensionsEnabled { get; set; }
```